# Practical 4.5: HBase Shell Commands

0. Start all required services for HBase (refer to Practical 4.4) using the user hduser account.

1. Edit student profile using the user student account
   ~~~bash
   student@MyPC:~$nano ~/.profile
   ~~~
   > Add the following lines:
   > export HBASE_HOME=/home/hduser/hbase                    
   > export PATH=$HBASE_HOME/bin:$PATH 

2. Starting and Exiting the HBase Shell using the user student account
   i. Invoke HBase shell
   ~~~bash
   student@MyPC:~$ hbase shell                                                                                                            
   hbase:001:0>
   ~~~

   ii. Exit the HBase shell
   > To exit the HBase Shell and disconnect from your cluster, use the quit command.
   > Note that HBase is still running in the background.

3. General HBase Shell Commands

   i. The status command
      ~~~bash
      hbase:001:0> status
      hbase:002:0> status 'simple'                                                                                               
      hbase:003:0> status 'summary'
      hbase:004:0> status 'detailed'
      ~~~                                                                                                           

    ii. The version command
      ~~~bash
      hbase:005:0> version                                                                                                                   
      ~~~
      
The list command
hbase:002:0> list
TABLE                                                                                                                                
0 row(s)
Took 0.0074 seconds                                                                                                                  
=> []


D. HBase Data Definition Language (DDL) Commands
The create command
Create a table named ‘t1’ with a column family ‘cf1’:
hbase:004:0> create 't1', 'cf1'
Created table t1
Took 1.1324 seconds                                                                                                                  
=> Hbase::Table - t1

Create a table named ‘emp’, with two column families: ‘personal data’ and ‘professional data’:
hbase:005:0> create 'emp', 'personal data', 'professional data'
Created table emp
Took 0.6120 seconds                                                                                                                  
=> Hbase::Table - emp

hbase:006:0> list
TABLE                                                                                                                                
emp                                                                                                                                  
t1                                                                                                                                   
2 row(s)
Took 0.0043 seconds                                                                                                                  
=> ["emp", "t1"]

The describe command
hbase:007:0> describe 'emp'
Table emp is ENABLED                                                                                                                 
emp                                                                                                                                  
COLUMN FAMILIES DESCRIPTION                                                                                                          
{NAME => 'personal data', BLOOMFILTER => 'ROW', IN_MEMORY => 'false', VERSIONS => '1', KEEP_DELETED_CELLS => 'FALSE', DATA_BLOCK_ENCODING => 'NONE', COMPRESSION => 'NONE', TTL => 'FOREVER', MIN_VERSIONS => '0', BLOCKCACHE => 'true', BLOCKSIZE => '65536', REPLICATION_SCOPE => '0'}
{NAME => 'professional data', BLOOMFILTER => 'ROW', IN_MEMORY => 'false', VERSIONS => '1', KEEP_DELETED_CELLS => 'FALSE', DATA_BLOCK_ENCODING => 'NONE', COMPRESSION => 'NONE', TTL => 'FOREVER', MIN_VERSIONS => '0', BLOCKCACHE => 'true', BLOCKSIZE => '65536', REPLICATION_SCOPE  => '0'}  
2 row(s)
Quota is disabled    

                                                                                                          
Namespaces
Create a namespace ‘ns1’
hbase:010:0> create_namespace 'ns1'
Create a table named ‘t1’ in the namespace ‘ns1’ with a column family cf1’ and maximum of 5 versions of all columns in the column family ‘cf1’:
hbase:011:0> create 'ns1:t1', {NAME=>'cf1', VERSIONS=>5}
Created table ns1:t1
Took 0.6119 seconds                                                                                                                  
=> Hbase::Table - ns1:t1
hbase:012:0> list
TABLE                                                                                                                                 
emp                                                                                                                                  
t1                                                                                                                                   
ns1:t1                          	 
3 row(s)
Took 0.0037 seconds                            
=> ["emp", "t1", "ns1:t1"]

Create a table named ‘t2’ in the namespace ‘ns1’ with two column families ‘cf1’ and ‘cf1’.
hbase:017:0> create 'ns1:t2', 'cf1', 'cf2'
Created table ns1:t2
Took 0.6252 seconds                                                                                                                   
=> Hbase::Table - ns1:t2
hbase:032:0> describe 'ns1:t2'
Table ns1:t2 is ENABLED                                  
ns1:t2                                                                              
COLUMN FAMILIES DESCRIPTION                                          
{NAME => 'cf1', BLOOMFILTER => 'ROW', IN_MEMORY => 'false', VERSIONS => '1', KEEP_DELETED_CELLS => 'FALSE', DATA_BLOCK_ENCODING => 'NONE',
 COMPRESSION => 'NONE', TTL => 'FOREVER', MIN_VERSIONS => '0', BLOCKCACHE => 'true', BLOCKSIZE => '65536', REPLICATION_SCOPE => '0'} 	 
{NAME => 'cf2', BLOOMFILTER => 'ROW', IN_MEMORY => 'false', VERSIONS => '1', KEEP_DELETED_CELLS => 'FALSE', DATA_BLOCK_ENCODING => 'NONE',
 COMPRESSION => 'NONE', TTL => 'FOREVER', MIN_VERSIONS => '0', BLOCKCACHE => 'true', BLOCKSIZE => '65536', REPLICATION_SCOPE => '0'}

The alter command
Add additional column families ‘cf3’, ‘cf4,  and ‘cf5’ to the table ‘n1:t2’:
hbase:033:0> alter 'ns1:t2', 'cf3', 'cf4', 'cf5'
Updating all regions with the new schema...
1/1 regions updated.
Done.                                                                                                                 
hbase:034:0> describe 'ns1:t2'
Table ns1:t2 is ENABLED                                         
ns1:t2                                                                                                                                
COLUMN FAMILIES DESCRIPTION     
{NAME => 'cf1', BLOOMFILTER => 'ROW', IN_MEMORY => 'false', VERSIONS => '1', KEEP_DELETED_CELLS => 'FALSE', DATA_BLOCK_ENCODING => 'NONE',
 COMPRESSION => 'NONE', TTL => 'FOREVER', MIN_VERSIONS => '0', BLOCKCACHE => 'true', BLOCKSIZE => '65536', REPLICATION_SCOPE => '0'} 	 
{NAME => 'cf2', BLOOMFILTER => 'ROW', IN_MEMORY => 'false', VERSIONS => '1', KEEP_DELETED_CELLS => 'FALSE', DATA_BLOCK_ENCODING => 'NONE',
 COMPRESSION => 'NONE', TTL => 'FOREVER', MIN_VERSIONS => '0', BLOCKCACHE => 'true', BLOCKSIZE => '65536', REPLICATION_SCOPE => '0'} 	 
{NAME => 'cf3', BLOOMFILTER => 'ROW', IN_MEMORY => 'false', VERSIONS => '1', KEEP_DELETED_CELLS => 'FALSE', DATA_BLOCK_ENCODING => 'NONE',
 COMPRESSION => 'NONE', TTL => 'FOREVER', MIN_VERSIONS => '0', BLOCKCACHE => 'true', BLOCKSIZE => '65536', REPLICATION_SCOPE => '0'} 	 
{NAME => 'cf4', BLOOMFILTER => 'ROW', IN_MEMORY => 'false', VERSIONS => '1', KEEP_DELETED_CELLS => 'FALSE', DATA_BLOCK_ENCODING => 'NONE',
 COMPRESSION => 'NONE', TTL => 'FOREVER', MIN_VERSIONS => '0', BLOCKCACHE => 'true', BLOCKSIZE => '65536', REPLICATION_SCOPE => '0'} 	 
{NAME => 'cf5', BLOOMFILTER => 'ROW', IN_MEMORY => 'false', VERSIONS => '1', KEEP_DELETED_CELLS => 'FALSE', DATA_BLOCK_ENCODING => 'NONE',
 COMPRESSION => 'NONE', TTL => 'FOREVER', MIN_VERSIONS => '0', BLOCKCACHE => 'true', BLOCKSIZE => '65536', REPLICATION_SCOPE => '0'} 	 
5 row(s)
Quota is disabled                                                                                        

Delete the  column family ‘cf3’ of the table ‘ns1:t2’:
hbase:035:0> alter 'ns1:t2', NAME=>'cf3', METHOD=>'delete'
Updating all regions with the new schema...
1/1 regions updated.
Done.                                                                                    

Delete the  column family ‘cf4’ of the table ‘ns1:t2’:
hbase:036:0> alter 'ns1:t2', 'delete'=>'cf4'
Updating all regions with the new schema...
1/1 regions updated.
Done.
hbase:038:0> describe 'ns1:t2'
Table ns1:t2 is ENABLED                                                                                  
ns1:t2                                                                                                     
COLUMN FAMILIES DESCRIPTION                                                                                
{NAME => 'cf1', BLOOMFILTER => 'ROW', IN_MEMORY => 'false', VERSIONS => '1', KEEP_DELETED_CELLS => 'FALSE', DATA
_BLOCK_ENCODING => 'NONE', COMPRESSION => 'NONE', TTL => 'FOREVER', MIN_VERSIONS => '0', BLOCKCACHE => 'true', B
LOCKSIZE => '65536', REPLICATION_SCOPE => '0'}                        
{NAME => 'cf2', BLOOMFILTER => 'ROW', IN_MEMORY => 'false', VERSIONS => '1', KEEP_DELETED_CELLS => 'FALSE', DATA
_BLOCK_ENCODING => 'NONE', COMPRESSION => 'NONE', TTL => 'FOREVER', MIN_VERSIONS => '0', BLOCKCACHE => 'true', B
LOCKSIZE => '65536', REPLICATION_SCOPE => '0'} 
{NAME => 'cf5', BLOOMFILTER => 'ROW', IN_MEMORY => 'false', VERSIONS => '1', KEEP_DELETED_CELLS => 'FALSE', DATA
_BLOCK_ENCODING => 'NONE', COMPRESSION => 'NONE', TTL => 'FOREVER', MIN_VERSIONS => '0', BLOCKCACHE => 'true', B
LOCKSIZE => '65536', REPLICATION_SCOPE => '0'}             
3 row(s)
Quota is disabled

Change the maximum number of versions of the columns in a  column family:
hbase:008:0> alter 'emp', {NAME=>'personal data', VERSIONS=>5}
Updating all regions with the new schema...
1/1 regions updated.
Done.                                                                                                             


E. HBase Data Manipulation Language (DML) Commands

Inserting values into tables
Put a cell value at a specified table/row/column (and optionally timestamp) coordinates. 
Note: HBase does not support insertion of multiple columns in a single statement. 
Put values into table ‘ns1:t2’
hbase:018:0> put 'ns1:t2', 'key1', 'cf1:name', 'John'

hbase:020:0> put 'ns1:t2', 'key1', 'cf1:id', 19191919                                                                                                            	 
hbase:021:0> put 'ns1:t2', 'key1', 'cf2:city', 'London'                                                                                                              	 
hbase:022:0> put 'ns1:t2', 'key1', 'cf2:country', 'UK'                                                                                                              	 
hbase:023:0> scan 'ns1:t2'
ROW    COLUMN+CELL                                                                                      
key1   column=cf1:id, timestamp=2023-01-30T13:13:08.862, value=19191919                                 
key1   column=cf1:name, timestamp=2023-01-30T13:12:38.217, value=John 
key1   column=cf2:city, timestamp=2023-01-30T13:13:22.566, value=London
key1   column=cf2:country, timestamp=2023-01-30T13:13:38.149, value=UK                                  
1 row(s)                                                             
Put values into table ‘emp’:
hbase:039:0> put 'emp', '1001', 'personal data:name', 'Thor'

hbase:042:0> put 'emp', '1001', 'personal data:city', 'Kuala Lumpur'

hbase:045:0> put 'emp', '1001', 'professional data:designation', 'manager'

hbase:001:0> put 'emp', '1001', 'professional data:email', 'thor@mail.abc.com'
                                                                                      
hbase:002:0> scan 'emp'
ROW       COLUMN+CELL                                        
 1001       column=personal data:city, timestamp=2023-01-30T14:58:40.290, value=Kuala Lumpur  
 1001       column=personal data:name, timestamp=2023-01-30T14:56:29.590, value=Thor     	 
 1001       column=professional data:designation, timestamp=2023-01-30T14:59:45.388, value=manager               
 1001       column=professional data:email, timestamp=2023-01-30T15:01:21.533, value=thor@mail.abc.com         
1 row(s)


Using table references

Get a table reference to the table ‘ns1:t2’
hbase:009:0> t = get_table "ns1:t2"

The commands to be performed on that table can now be invoked directly on the table reference: 
hbase:010:0> t.scan
ROW      COLUMN+CELL                        
 key1    column=cf1:id, timestamp=2023-01-30T13:39:09, value=19191919 
 key1    column=cf1:name, timestamp=2023-01-30T13:38:59.968, value=John   
 key1    column=cf2:city, timestamp=2023-01-30T13:13:22.566, value=London
 key1    column=cf2:country, timestamp=2023-01-30T13:13:38.149, value=UK  
1 row(s)

Get a table reference to the table ‘ns1:t1’:
hbase:009:0> t = get_table "ns1:t1"

Insert values into the table “ns1:t1” using the table reference :
hbase:003:0> t.put 'key2', 'cf1:city', 'KL'
hbase:004:0> t.put 'key2', 'cf1:id', 87654321
hbase:005:0> t.put 'key2', 'cf1:name', 'Minnie'


Updating table values
put '<table_name>’, ‘<rowkey>’, ‘<column_family>:<column>’, ‘<new_value>’
Updating the value for ‘cf1.name’ to ‘Jack’
hbase:020:0>  put 'ns1:t2', 'key1', 'cf1:name', 'Jack'                           

Updating the value for ‘cf1.city’ using the table reference t:
hbase:024:0> t.put 'key1', 'cf1:city', 'Manchester'
hbase:025:0> t.scan
ROW    COLUMN+CELL        
 key1     column=cf1:id, timestamp=2023-01-30T13:39:09, value=19191919                  
 key1     column=cf1:name, timestamp=2023-01-30T15:48:02.416, value=Jack
 key1     column=cf2:city, timestamp=2023-01-30T15:48:45.190, value=Manchester         	 
 key1     column=cf2:country, timestamp=2023-01-30T13:13:38.149, value=UK              	 
1 row(s)


Reading row data / filtering data
Get a single row’s data:
hbase:001:0> get 'ns1:t1', 'key1' 
COLUMN     	 CELL                       
 cf1:city    timestamp=2023-01-30T16:05:37.433, value=Sydney                              
 cf1:id      timestamp=2023-01-30T13:10:49.656, value=19191919                            
 cf1:name    timestamp=2023-01-30T13:10:30.746, value=John 
1 row(s)

Get a single column’s data of a row:
hbase:009:0> get 'ns1:t1', 'key2', {COLUMN=>'cf1:city'}
COLUMN      CELL                                     
 cf1:city   timestamp=2023-01-30T16:23:28.667, value=KL                    
1 row(s)

Filtering only certain columns:
hbase:001:0> scan 'ns1:t1', {COLUMNS => ['cf1:name', 'cf1:city']}
ROW       COLUMN+CELL              
 key1     column=cf1:city, timestamp=2023-01-30T16:05:37.433, value=Sydney             	 
 key1     column=cf1:name, timestamp=2023-01-30T13:10:30.746, value=John 	

Count the number of rows of a table
hbase:020:0> t.scan
ROW   COLUMN+CELL                                                                 
key1  column=cf1:city, timestamp=2023-01-30T16:59:29.425, value=London 
key1  column=cf1:id, timestamp=2023-01-30T16:59:54.681, value=19191919 
key1  column=cf1:name, timestamp=2023-01-30T17:00:07.744, value=John 
key2  column=cf1:city, timestamp=2023-01-30T16:23:28.667, value=KL
key2  column=cf1:id, timestamp=2023-01-30T16:23:51.377, value=87654321
key2  column=cf1:name, timestamp=2023-01-30T16:24:12.210, value=Minnie 
2 row(s)                                                                                     
hbase:021:0> t.count
2 row(s)
Took 0.0103 seconds                                                                                         	=> 2

Deleting cells in a table
Delete a specific cell in a table
Syntax: delete ‘<table_name>’, ‘<rowkey>’, ‘<column_family>:<column>’
hbase:010:0> delete 'ns1:t1', 'key1', 'cf1:city'                                                                                  
hbase:011:0> scan 'ns1:t1'
ROW   COLUMN+CELL                                                                  
key1  column=cf1:city, timestamp=2023-01-30T13:11:06.359, value=London
key1  column=cf1:id, timestamp=2023-01-30T13:10:49.656, value=19191919 
key1  column=cf1:name, timestamp=2023-01-30T13:10:30.746, value=John 
key2  column=cf1:city, timestamp=2023-01-30T16:23:28.667, value=KL                 key2  column=cf1:id, timestamp=2023-01-30T16:23:51.377, value=87654321             key2  column=cf1:name, timestamp=2023-01-30T16:24:12.210, value=Minnie             
2 row(s)
hbase:001:0> delete 'ns1:t1', 'key1', 'cf1:city'                                                                                     
hbase:002:0> scan 'ns1:t1'
ROW    COLUMN+CELL                      
key1   column=cf1:id, timestamp=2023-01-30T13:10:49.656, value=19191919
key1   column=cf1:name, timestamp=2023-01-30T13:10:30.746, value=John      
key2   column=cf1:city, timestamp=2023-01-30T16:23:28.667, value=KL    
key2   column=cf1:id, timestamp=2023-01-30T16:23:51.377, value=87654321   
key2   column=cf1:name, timestamp=2023-01-30T16:24:12.210, value=Minnie             
2 row(s)
 
Delete all cells for a specific row
hbase:003:0> deleteall 'ns1:t1', 'key1'                                                                                     
hbase:004:0> scan 'ns1:t1'
ROW     COLUMN+CELL             
 key2   column=cf1:city, timestamp=2023-01-30T16:23:28.667, value=KL    
 key2   column=cf1:id, timestamp=2023-01-30T16:23:51.377, value=87654321             	 
 key2   column=cf1:name, timestamp=2023-01-30T16:24:12.210, value=Minnie     
1 row(s)
Took 0.0041 seconds 


Drop table
hbase:005:0> list
TABLE                                                                                                      
emp                                                                                                        
t1                                                                                                         
ns1:t1                                                                                                     
ns1:t2                                                                                                     
4 row(s)
Took 0.0431 seconds                                                                                        
=> ["emp", "t1", "ns1:t1", "ns1:t2"]
hbase:006:0> drop 't1'
ERROR: Table t1 is enabled. Disable it first.
For usage try 'help "drop"'                                                                                    
hbase:007:0> disable 't1'                                                                                     
hbase:008:0> drop 't1'                                                                                    
hbase:009:0> list
TABLE                                                                                                      
emp                                                                                                        
ns1:t1                                                                                                     
ns1:t2                                                                                                     
3 row(s)
Took 0.0044 seconds                                                                                       
=> ["emp", "ns1:t1", "ns1:t2"]

