# Practical 4.5: HBase Shell Commands

## A. Start all required services for HBase 
Refer to Practical 4.4 and do them using the user hduser account.

## B. Setup
1. Edit student profile using the user student account
   ~~~bash
   student@MyPC:~$nano ~/.profile
   ~~~
   > Add the following lines:
   > 
   > export HBASE_HOME=/home/hduser/hbase
   >                  
   > export PATH=$HBASE_HOME/bin:$PATH 

2. Starting and Exiting the HBase Shell using the user student account

   i. Invoke HBase shell
   ~~~bash
   student@MyPC:~$ hbase shell                                                                                                            
   hbase:001:0>
   ~~~

   ii. Exit the HBase shell
   > To exit the HBase Shell and disconnect from your cluster, use the quit command.
   > Note that HBase is still running in the background.

## C. General HBase Shell Commands.
Issue the following commands and observe the output for each of them.

1. The status command
   ~~~bash
   hbase:001:0> status
   hbase:002:0> status 'simple'                                                                                               
   hbase:003:0> status 'summary'
   hbase:004:0> status 'detailed'
   ~~~                                                                                                           

2. The version command
   ~~~bash
   hbase:005:0> version                                                                                                                   
   ~~~
      
3. The list command
   ~~~bash
   hbase:006:0> list
   ~~~

## D. HBase Data Definition Language (DDL) Commands. 
Issue the following commands and observe the output for each of them.

1. The create command

   i. Create a table named ‘t1’ with a column family ‘cf1’:
      ~~~bash
      hbase:007:0> create 't1', 'cf1'
      ~~~

   ii. Create a table named ‘emp’, with two column families: ‘personal data’ and ‘professional data’:
      ~~~bash
      hbase:008:0> create 'emp', 'personal data', 'professional data'
      hbase:009:0> list
      ~~~

   iii. The describe command
      ~~~bash
      hbase:010:0> describe 'emp'
      ~~~  

                                                                                                          
2. Namespaces
   i. Create a namespace ‘ns1’
      ~~~bash
      hbase:011:0> create_namespace 'ns1'
      ~~~  

   ii. Create a table named ‘t1’ in the namespace ‘ns1’ with a column family cf1’ and maximum of 5 versions of all columns in the column family ‘cf1’:
      ~~~bash
      hbase:012:0> create 'ns1:t1', {NAME=>'cf1', VERSIONS=>5}
      ~~~  

   iii. Create a table named ‘t2’ in the namespace ‘ns1’ with two column families ‘cf1’ and ‘cf1’.
      ~~~bash
      hbase:013:0> create 'ns1:t2', 'cf1', 'cf2'
      hbase:014:0> describe 'ns1:t2'
      ~~~  

9. The alter command

   i. Add additional column families ‘cf3’, ‘cf4,  and ‘cf5’ to the table ‘n1:t2’:
      ~~~bash
      hbase:015:0> alter 'ns1:t2', 'cf3', 'cf4', 'cf5'                                                                                                       
      hbase:016:0> describe 'ns1:t2'
      ~~~  

   ii. Delete the  column family ‘cf3’ of the table ‘ns1:t2’:
      ~~~bash
      hbase:017:0> alter 'ns1:t2', NAME=>'cf3', METHOD=>'delete'
      ~~~                                                                                   

   iii. Delete the  column family ‘cf4’ of the table ‘ns1:t2’:
      ~~~bash
      hbase:018:0> alter 'ns1:t2', 'delete'=>'cf4'
      hbase:019:0> describe 'ns1:t2'
      ~~~

   iv. Change the maximum number of versions of the columns in a  column family:
      ~~~bash
      hbase:020:0> alter 'emp', {NAME=>'personal data', VERSIONS=>5}
      ~~~                                                                                                           


## E. HBase Data Manipulation Language (DML) Commands
Issue the following commands and observe the output for each of them.

1. Inserting values into tables
   i. Put values into table ‘ns1:t2’
      ~~~bash
      hbase:021:0> put 'ns1:t2', 'key1', 'cf1:name', 'John'
      hbase:022:0> put 'ns1:t2', 'key1', 'cf1:id', 19191919                                                                                                  
      hbase:023:0> put 'ns1:t2', 'key1', 'cf2:city', 'London'                                                                                                
      hbase:024:0> put 'ns1:t2', 'key1', 'cf2:country', 'UK'                                                                                                 
      hbase:025:0> scan 'ns1:t2'
      ~~~
   > Put a cell value at a specified table/row/column (and optionally timestamp) coordinates.
   > 
   > Note: HBase does not support insertion of multiple columns in a single statement.
      
   ii. Put values into table ‘emp’:
      ~~~bash
      hbase:026:0> put 'emp', '1001', 'personal data:name', 'Thor'
      hbase:027:0> put 'emp', '1001', 'personal data:city', 'Kuala Lumpur'
      hbase:028:0> put 'emp', '1001', 'professional data:designation', 'manager'
      hbase:029:0> put 'emp', '1001', 'professional data:email', 'thor@mail.abc.com'
      hbase:030:0> scan 'emp'
      ~~~

2. Using table references

   i. Get a table reference to the table ‘ns1:t2’
      ~~~bash
      hbase:031:0> t = get_table "ns1:t2"
      ~~~
      
    ii. The commands to be performed on that table can now be invoked directly on the table reference:
      ~~~bash
      hbase:032:0> t.scan
      ~~~

    iii. Get a table reference to the table ‘ns1:t1’:
      ~~~bash
      hbase:033:0> t = get_table "ns1:t1"
      ~~~
      
    iv. Insert values into the table “ns1:t1” using the table reference :
      ~~~bash
      hbase:034:0> t.put 'key2', 'cf1:city', 'KL'
      hbase:035:0> t.put 'key2', 'cf1:id', 87654321
      hbase:036:0> t.put 'key2', 'cf1:name', 'Minnie'
      ~~~

3. Updating table values - Syntax: put '<table_name>’, ‘<rowkey>’, ‘<column_family>:<column>’, ‘<new_value>’

   i. Updating the value for ‘cf1.name’ to ‘Jack’
      ~~~bash
      hbase:037:0>  put 'ns1:t2', 'key1', 'cf1:name', 'Jack'                           
      ~~~
      
   ii. Updating the value for ‘cf1.city’ using the table reference t:
      ~~~bash
      hbase:038:0> t.put 'key1', 'cf1:city', 'Manchester'
      hbase:039:0> t.scan
      ~~~

5. Reading row data / filtering data

   i. Get a single row’s data:
      ~~~bash
      hbase:040:0> get 'ns1:t1', 'key1' 
      ~~~

   ii. Get a single column’s data of a row:
      ~~~bash
      hbase:041:0> get 'ns1:t1', 'key2', {COLUMN=>'cf1:city'}
      ~~~

   iii. Filtering only certain columns:
      ~~~bash
      hbase:042:0> scan 'ns1:t1', {COLUMNS => ['cf1:name', 'cf1:city']}
      ~~~

6. Count the number of rows of a table
~~~bash
hbase:043:0> t.scan
hbase:044:0> t.count
~~~

6. Deleting cells in a table

   i. Delete a specific cell in a table - Syntax: delete ‘<table_name>’, ‘<rowkey>’, ‘<column_family>:<column>’
      ~~~bash
      hbase:045:0> delete 'ns1:t1', 'key1', 'cf1:city'                                                                                  
      hbase:046:0> scan 'ns1:t1'

      hbase:047:0> delete 'ns1:t1', 'key1', 'cf1:city'                                                                                     
      hbase:048:0> scan 'ns1:t1'
      ~~~
 
   ii. Delete all cells for a specific row
      ~~~bash
      hbase:049:0> deleteall 'ns1:t1', 'key1'                                                                                     
      hbase:050:0> scan 'ns1:t1'
      ~~~


7. Drop table
~~~bash
hbase:051:0> list
hbase:052:0> drop 't1'                                                                                 
hbase:053:0> disable 't1'                                                                                     
hbase:054:0> drop 't1'                                                                                    
hbase:055:0> list
~~~

