{"cells":[{"cell_type":"markdown","id":"299295eb-e09d-41e0-ae95-d1e20b8826a4","metadata":{"id":"299295eb-e09d-41e0-ae95-d1e20b8826a4"},"source":["# NOTEBOOK 4.1 Neo4j\n","\n","Read in/replace the values for the following variables with your own:\n","- URI\n","- neo4j_password"]},{"cell_type":"code","execution_count":null,"id":"3c52af9a-0a36-44db-8ca0-6e3fa087ab1c","metadata":{"id":"3c52af9a-0a36-44db-8ca0-6e3fa087ab1c"},"outputs":[],"source":["from neo4j import GraphDatabase\n","\n","URI = \"<Your AuraDB neo4j cluster URI>\" ### !!!! REMEMBER TO DELETE AND REPLACE\n","\n","neo4j_user = \"neo4j\"\n","neo4j_password = \"<Your AuraDB neo4j cluster password>\"  ###  !!!! REMEMBER TO DELETE AND REPLACE\n","\n","AUTH = (neo4j_user, neo4j_password)\n","driver = GraphDatabase.driver(URI, auth=AUTH)"]},{"cell_type":"code","execution_count":null,"id":"aecccc0e-bd84-4c8f-8fcd-623e293fe86c","metadata":{"id":"aecccc0e-bd84-4c8f-8fcd-623e293fe86c"},"outputs":[],"source":["driver.verify_connectivity()"]},{"cell_type":"markdown","id":"1705474d-0edf-4591-bf96-d1b9bd2c77a1","metadata":{"id":"1705474d-0edf-4591-bf96-d1b9bd2c77a1"},"source":["# Create a node representing a person named Alice"]},{"cell_type":"code","execution_count":null,"id":"5ca262c3-0580-4ed7-964d-8ed694738c0e","metadata":{"id":"5ca262c3-0580-4ed7-964d-8ed694738c0e"},"outputs":[],"source":["summary = driver.execute_query(\n","    \"CREATE (:Person {name: $name})\",\n","    name=\"Alice\",\n","    database_=\"neo4j\",\n",").summary"]},{"cell_type":"code","execution_count":null,"id":"9f67a24e-6fc4-4a02-ae39-ca3dbf133c40","metadata":{"id":"9f67a24e-6fc4-4a02-ae39-ca3dbf133c40","outputId":"1aaac817-8462-485a-fd31-70b87b716d80"},"outputs":[{"name":"stdout","output_type":"stream","text":["Created 1 nodes in 39 ms.\n"]}],"source":["print(\"Created {nodes_created} nodes in {time} ms.\".format(\n","    nodes_created = summary.counters.nodes_created,\n","    time=summary.result_available_after\n","))"]},{"cell_type":"markdown","id":"deb4bb38-5931-403a-a39b-7cdf343d9cbf","metadata":{"id":"deb4bb38-5931-403a-a39b-7cdf343d9cbf"},"source":["# Retrieve all Person nodes"]},{"cell_type":"code","execution_count":null,"id":"4e150152-41c9-40db-b462-91908e168027","metadata":{"id":"4e150152-41c9-40db-b462-91908e168027","outputId":"5e35bf37-b21e-439c-8f1f-1dc89152fd34"},"outputs":[{"name":"stdout","output_type":"stream","text":["{'name': 'Alice'}\n","The query `MATCH (p:Person) RETURN p.name AS name` returned 1 records in 27 ms.\n"]}],"source":["records, summary, keys = driver.execute_query(\n","    \"MATCH (p:Person) RETURN p.name AS name\",\n","    database_=\"neo4j\",\n",")\n","\n","# Loop through results and do something with them\n","for record in records:\n","    print(record.data())  # obtain record as dict\n","\n","# Summary information\n","print(\"The query `{query}` returned {records_count} records in {time} ms.\".format(\n","    query=summary.query, records_count=len(records),\n","    time=summary.result_available_after\n","))"]},{"cell_type":"markdown","id":"8694c592-1369-4bc2-af56-d0148995ff3e","metadata":{"id":"8694c592-1369-4bc2-af56-d0148995ff3e"},"source":["# Update the database"]},{"cell_type":"code","execution_count":null,"id":"82b6a357-a933-4534-bc7a-9fe3f13a2503","metadata":{"id":"82b6a357-a933-4534-bc7a-9fe3f13a2503","outputId":"90944357-633b-4a26-e74c-e53753a1b8a1"},"outputs":[{"name":"stdout","output_type":"stream","text":["Query counters: {'_contains_updates': True, 'properties_set': 1}.\n"]}],"source":["records, summary, keys = driver.execute_query(\"\"\"\n","    MATCH (p:Person {name: $name})\n","    SET p.age = $age\n","    \"\"\", name=\"Alice\", age=42,\n","    database_=\"neo4j\",\n",")\n","\n","print(f\"Query counters: {summary.counters}.\")"]},{"cell_type":"markdown","id":"313bbb40-2bc4-4cef-8713-fbcfd0ca5cd1","metadata":{"id":"313bbb40-2bc4-4cef-8713-fbcfd0ca5cd1"},"source":["# Create a relationship :KNOWS between Alice and Bob"]},{"cell_type":"code","execution_count":null,"id":"a595ccf7-bbe5-4829-810e-950beef071ac","metadata":{"id":"a595ccf7-bbe5-4829-810e-950beef071ac","outputId":"4a4fbe8a-e0fe-4d09-af33-c3d0b6bd66c8"},"outputs":[{"name":"stdout","output_type":"stream","text":["Query counters: {'_contains_updates': True, 'labels_added': 1, 'relationships_created': 1, 'nodes_created': 1, 'properties_set': 1}.\n"]}],"source":["records, summary, keys = driver.execute_query(\"\"\"\n","    MATCH (p:Person {name: $name})\n","    CREATE (p)-[:KNOWS]->(:Person {name: $friend})\n","    \"\"\", name=\"Alice\", friend=\"Bob\",\n","    database_=\"neo4j\",\n",")\n","\n","print(f\"Query counters: {summary.counters}.\")"]},{"cell_type":"markdown","id":"2b16b3b2-cac2-4ecf-9531-a793ef24859c","metadata":{"id":"2b16b3b2-cac2-4ecf-9531-a793ef24859c"},"source":["# Remove the Alice node"]},{"cell_type":"code","execution_count":null,"id":"eff1c52c-12a0-48d5-806c-f9c34bba897e","metadata":{"id":"eff1c52c-12a0-48d5-806c-f9c34bba897e","outputId":"22ed1f20-acbf-402f-f758-08da08c95791"},"outputs":[{"name":"stdout","output_type":"stream","text":["Query counters: {'_contains_updates': True, 'nodes_deleted': 1, 'relationships_deleted': 1}.\n"]}],"source":["records, summary, keys = driver.execute_query(\"\"\"\n","    MATCH (p:Person {name: $name})\n","    DETACH DELETE p\n","    \"\"\", name=\"Alice\",\n","    database_=\"neo4j\",\n",")\n","\n","print(f\"Query counters: {summary.counters}.\")"]},{"cell_type":"markdown","id":"142139b6-c2bc-489e-9ddd-e5264b2505f7","metadata":{"id":"142139b6-c2bc-489e-9ddd-e5264b2505f7"},"source":["# Query parameters\n","\n","## (a) Pass query parameters as keyword arguments"]},{"cell_type":"code","execution_count":null,"id":"47f220c9-0507-4e90-bfa0-9d4f098b2fd1","metadata":{"id":"47f220c9-0507-4e90-bfa0-9d4f098b2fd1","outputId":"6e2c584c-e6f9-4cb2-b7a5-0597f25c5fdd"},"outputs":[{"data":{"text/plain":["EagerResult(records=[], summary=<neo4j._work.summary.ResultSummary object at 0x7f0ca19cd690>, keys=[])"]},"execution_count":11,"metadata":{},"output_type":"execute_result"}],"source":["driver.execute_query(\n","    \"MERGE (:Person {name: $name})\",\n","    name=\"Alice\", age=42,\n","    database_=\"neo4j\",\n",")"]},{"cell_type":"markdown","id":"490c0349-4fde-4ceb-980d-1288626072d8","metadata":{"id":"490c0349-4fde-4ceb-980d-1288626072d8"},"source":["## (b) Pass query parameters in a dictionary"]},{"cell_type":"code","execution_count":null,"id":"e99aa228-d82e-48ec-a48e-9cdcb034d5c9","metadata":{"id":"e99aa228-d82e-48ec-a48e-9cdcb034d5c9","outputId":"deba47e5-6e77-4ea6-e985-646b4f397689"},"outputs":[{"data":{"text/plain":["EagerResult(records=[], summary=<neo4j._work.summary.ResultSummary object at 0x7f0ca16295d0>, keys=[])"]},"execution_count":14,"metadata":{},"output_type":"execute_result"}],"source":["parameters = {\n","    \"name\": \"Hobbes\",\n","    \"age\": 23\n","}\n","\n","driver.execute_query(\n","    \"MERGE (:Person {name: $name})\",\n","    parameters_=parameters,\n","    database_=\"neo4j\",\n",")"]},{"cell_type":"code","execution_count":null,"id":"ebe3cf16-9cf4-477d-8f5e-7dbcd36f32b5","metadata":{"id":"ebe3cf16-9cf4-477d-8f5e-7dbcd36f32b5","outputId":"ed3205ef-ed74-4c8b-e638-44df36ce76fc"},"outputs":[{"name":"stdout","output_type":"stream","text":["[<Record name='Alice'>, <Record name='Bob'>, <Record name='Hobbes'>]\n"]}],"source":["records, summary, keys = driver.execute_query(\n","    \"MATCH (p:Person) RETURN p.name AS name\",\n","    database_=\"neo4j\",\n",")\n","\n","print(records)"]},{"cell_type":"code","execution_count":null,"id":"21aab11f-fb77-443f-a26e-e2ac0b460d8a","metadata":{"id":"21aab11f-fb77-443f-a26e-e2ac0b460d8a","outputId":"9bbc0d19-0e27-4d11-a81f-e1a83eb1650c"},"outputs":[{"name":"stdout","output_type":"stream","text":["<Record friend=<Node element_id='4:b225ba6d-ca62-48b1-9a46-0e48d0e4641d:4' labels=frozenset({'Person'}) properties={'name': 'Odie', 'age': 19}>>\n","<Record friend=<Node element_id='4:b225ba6d-ca62-48b1-9a46-0e48d0e4641d:6' labels=frozenset({'Person'}) properties={'name': 'Anna', 'age': 30}>>\n","The query `\n","            MATCH (p:Person {name: $name})-[:KNOWS]-(friend:Person)\n","            WHERE friend.age < $age\n","            RETURN friend\n","            ` returned 2 records in 54 ms.\n"]}],"source":["people = [{\"name\": \"Garfield\", \"age\": 42, \"friends\": [\"Odie\", \"Peter\", \"Anna\"]},\n","          {\"name\": \"Odie\", \"age\": 19},\n","          {\"name\": \"Peter\", \"age\": 50},\n","          {\"name\": \"Anna\", \"age\": 30}]\n","\n","with GraphDatabase.driver(URI, auth=AUTH) as driver:\n","    try:\n","        # Create some nodes\n","        for person in people:\n","            records, summary, keys = driver.execute_query(\n","                \"MERGE (p:Person {name: $person.name, age: $person.age})\",\n","                person=person,\n","                database_=\"neo4j\",\n","            )\n","\n","        # Create some relationships\n","        for person in people:\n","            if person.get(\"friends\"):\n","                records, summary, keys = driver.execute_query(\"\"\"\n","                    MATCH (p:Person {name: $person.name})\n","                    UNWIND $person.friends AS friend_name\n","                    MATCH (friend:Person {name: friend_name})\n","                    MERGE (p)-[:KNOWS]->(friend)\n","                    \"\"\", person=person,\n","                    database_=\"neo4j\",\n","                )\n","\n","        # Retrieve Garfield's friends who are under 40\n","        records, summary, keys = driver.execute_query(\"\"\"\n","            MATCH (p:Person {name: $name})-[:KNOWS]-(friend:Person)\n","            WHERE friend.age < $age\n","            RETURN friend\n","            \"\"\", name=\"Garfield\", age=40,\n","            routing_=\"r\",\n","            database_=\"neo4j\",\n","        )\n","        # Loop through results and do something with them\n","        for record in records:\n","            print(record)\n","        # Summary information\n","        print(\"The query `{query}` returned {records_count} records in {time} ms.\".format(\n","            query=summary.query, records_count=len(records),\n","            time=summary.result_available_after\n","        ))\n","\n","    except Exception as e:\n","        print(e)\n","        # further logging/processing\n"]},{"cell_type":"code","execution_count":null,"id":"7bd4512c-8c16-456f-9244-abca401a395e","metadata":{"id":"7bd4512c-8c16-456f-9244-abca401a395e"},"outputs":[],"source":[]},{"cell_type":"code","execution_count":null,"id":"d2ca9de1-1cb6-421b-8f70-f6bcc449db5a","metadata":{"id":"d2ca9de1-1cb6-421b-8f70-f6bcc449db5a"},"outputs":[],"source":[]}],"metadata":{"kernelspec":{"display_name":"de-venv","language":"python","name":"de-venv"},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.10.12"},"colab":{"provenance":[]}},"nbformat":4,"nbformat_minor":5}